; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	spectrograph2 - mode
	thermograph3 - mode
	infrared6 - mode
	infrared4 - mode
	infrared0 - mode
	infrared1 - mode
	spectrograph5 - mode
	Star5 - direction
	Star4 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star0 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 infrared4)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph5)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared4)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument3 thermograph3)
	(supports instrument3 spectrograph5)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star4)
	(supports instrument4 infrared4)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument5 infrared0)
	(supports instrument5 infrared6)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 spectrograph2)
	(supports instrument6 spectrograph5)
	(supports instrument6 infrared4)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon6)
	(supports instrument7 infrared1)
	(supports instrument7 spectrograph5)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star0)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon9)
)
(:goal (and
	(have_image Phenomenon6 infrared1)
	(have_image Phenomenon6 infrared6)
	(have_image Phenomenon7 infrared6)
	(have_image Phenomenon7 infrared4)
	(have_image Planet8 thermograph3)
	(have_image Planet8 infrared0)
	(have_image Phenomenon9 spectrograph5)
	(have_image Phenomenon10 infrared4)
))

)

; plan
1. (turn_to satellite3 star0 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 star0)
   goals met: 0 of 8
2. (turn_to satellite2 groundstation2 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 8
3. (turn_to satellite1 groundstation2 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 8
4. (turn_to satellite0 groundstation2 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 8
5. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 8
6. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 8
7. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
9. (calibrate satellite3 instrument7 star0)
   added: (calibrated instrument7)
   goals met: 0 of 8
10. (calibrate satellite2 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 0 of 8
11. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 8
12. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 8
13. (turn_to satellite0 phenomenon10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon10)
   goals met: 0 of 8
14. (take_image satellite0 phenomenon10 instrument0 infrared4)
   added: (have_image phenomenon10 infrared4)
   goals met: 1 of 8
15. (turn_to satellite0 phenomenon7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon7)
   goals met: 1 of 8
16. (take_image satellite0 phenomenon7 instrument0 infrared4)
   added: (have_image phenomenon7 infrared4)
   goals met: 2 of 8
17. (turn_to satellite1 phenomenon9 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon9)
   goals met: 2 of 8
18. (take_image satellite1 phenomenon9 instrument3 spectrograph5)
   added: (have_image phenomenon9 spectrograph5)
   goals met: 3 of 8
19. (turn_to satellite1 planet8 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet8)
   goals met: 3 of 8
20. (take_image satellite1 planet8 instrument3 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 4 of 8
21. (take_image satellite1 planet8 instrument3 thermograph3)
   added: (have_image planet8 thermograph3)
   goals met: 5 of 8
22. (turn_to satellite2 phenomenon6 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon6)
   goals met: 5 of 8
23. (take_image satellite2 phenomenon6 instrument5 infrared6)
   added: (have_image phenomenon6 infrared6)
   goals met: 6 of 8
24. (turn_to satellite2 phenomenon7 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon7)
   goals met: 6 of 8
25. (take_image satellite2 phenomenon7 instrument5 infrared6)
   added: (have_image phenomenon7 infrared6)
   goals met: 7 of 8
26. (turn_to satellite3 phenomenon6 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 phenomenon6)
   goals met: 7 of 8
27. (take_image satellite3 phenomenon6 instrument7 infrared1)
   added: (have_image phenomenon6 infrared1)
   goals met: 8 of 8
